# Импорты и загрузка датасета

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import itertools
import os
from collections import Counter
data = pd.read_csv(r"data_IMBD.csv")
print(len(data))
data.head(2)

1890

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015

# Предобработка датасета

In [2]:
answer_ls = []  # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста


#прибыль
data['profit'] = data.revenue - data.budget
#дата выхода как дата
data['release_date_as_date'] = pd.to_datetime(data.release_date)
#месяц выхода
data['release_month'] = data.release_date_as_date.dt.month
display(data.head(3))

#подготовка фреймов с "расщепленными" столбцами  Version 1
#l_cast = []
#l_companies = []
#l_genres = []
#l_directors = []
#for x in [(d[1].imdb_id, d[1].cast.split('|'), d[1].production_companies.split('|'), 
#           d[1].genres.split('|'), d[1].director.split('|')) for d in data.iterrows()]:
#    for c in x[1]:
#        l_cast.append([x[0], c])
#    for c in x[2]:
#        l_companies.append([x[0], c])
#    for c in x[3]:
#        l_genres.append([x[0], c])
#    for c in x[4]:
#        l_directors.append([x[0], c])
#casts = pd.DataFrame(columns=['imdb_id', 'actor'], data=l_cast)
#production_companies = pd.DataFrame(columns=['imdb_id', 'production_company'], data=l_companies)
#genres = pd.DataFrame(columns=['imdb_id', 'genre'], data=l_genres)
#directors = pd.DataFrame(columns=['imdb_id', 'a_director'], data=l_directors)


#подготовка фреймов с "расщепленными" столбцами  Version 2
def split_field(df, field, l):
    for s in [s for s in df[field].split('|')]:
        #print(s)
        l.append([df['imdb_id'], s])
lst = []
data.apply(lambda x: split_field(x, 'cast', lst), axis=1)
casts = pd.DataFrame(columns=['imdb_id', 'actor'], data=lst)
lst = []
data.apply(lambda x: split_field(x, 'production_companies', lst), axis=1)
production_companies = pd.DataFrame(columns=['imdb_id', 'production_company'], data=lst)
lst = []
data.apply(lambda x: split_field(x, 'genres', lst), axis=1)
genres = pd.DataFrame(columns=['imdb_id', 'genre'], data=lst)
lst = []
data.apply(lambda x: split_field(x, 'director', lst), axis=1)
directors = pd.DataFrame(columns=['imdb_id', 'a_director'], data=lst)

#обзор сформированных фреймов
display('data', len(data), data.head(3))
display('casts', len(casts), casts.head(3))
display('production_companies', len(production_companies), production_companies.head(3))
display('genres', len(genres), genres.head(3))
display('directors', len(directors), directors.head(3))

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,profit,release_date_as_date,release_month
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015,1363528810,2015-06-09,6
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015,228436354,2015-05-13,5
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015,185238201,2015-03-18,3

'data'

1890

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,profit,release_date_as_date,release_month
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015,1363528810,2015-06-09,6
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015,228436354,2015-05-13,5
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015,185238201,2015-03-18,3

'casts'

9443

     imdb_id                actor
0  tt0369610          Chris Pratt
1  tt0369610  Bryce Dallas Howard
2  tt0369610          Irrfan Khan

'production_companies'

6079

     imdb_id    production_company
0  tt0369610     Universal Studios
1  tt0369610  Amblin Entertainment
2  tt0369610    Legendary Pictures

'genres'

5112

     imdb_id            genre
0  tt0369610           Action
1  tt0369610        Adventure
2  tt0369610  Science Fiction

'directors'

2054

     imdb_id        a_director
0  tt0369610   Colin Trevorrow
1  tt1392190     George Miller
2  tt2908446  Robert Schwentke

In [3]:
answer_ls = []  # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете
data['profit'] = data.revenue - data.budget
data['release_date_as_date'] = pd.to_datetime(data.release_date)
data['release_month'] = data.release_date_as_date.dt.month
display(data.head(3))

l_cast = []
l_companies = []
l_genres = []
l_directors = []
for x in [(d[1].imdb_id, d[1].cast.split('|'), d[1].production_companies.split('|'), 
           d[1].genres.split('|'), d[1].director.split('|')) for d in data.iterrows()]:
    for c in x[1]:
        l_cast.append([x[0], c])
    for c in x[2]:
        l_companies.append([x[0], c])
    for c in x[3]:
        l_genres.append([x[0], c])
    for c in x[4]:
        l_directors.append([x[0], c])

casts = pd.DataFrame(columns=['imdb_id', 'actor'], data=l_cast)
production_companies = pd.DataFrame(columns=['imdb_id', 'production_company'], data=l_companies)
genres = pd.DataFrame(columns=['imdb_id', 'genre'], data=l_genres)
directors = pd.DataFrame(columns=['imdb_id', 'a_director'], data=l_directors)

print(len(data), len(casts), len(production_companies), len(genres), len(directors))
display(casts.head(3))
display(production_companies.head(3))
display(genres.head(3))
display(directors.head(3))

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,profit,release_date_as_date,release_month
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015,1363528810,2015-06-09,6
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015,228436354,2015-05-13,5
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015,185238201,2015-03-18,3

1890 9443 6079 5112 2054

     imdb_id                actor
0  tt0369610          Chris Pratt
1  tt0369610  Bryce Dallas Howard
2  tt0369610          Irrfan Khan

     imdb_id    production_company
0  tt0369610     Universal Studios
1  tt0369610  Amblin Entertainment
2  tt0369610    Legendary Pictures

     imdb_id            genre
0  tt0369610           Action
1  tt0369610        Adventure
2  tt0369610  Science Fiction

     imdb_id        a_director
0  tt0369610   Colin Trevorrow
1  tt1392190     George Miller
2  tt2908446  Robert Schwentke

In [4]:
# ====== Подбор синонимов для имен компаний ==========

syn_company = {}

#print([c for c in sorted(production_companies.production_company.unique()) if "Universal" in c])
syn_company['Universal'] = ['Universal',
                            'Universal Pictures', 'Universal Studios']
# ['Universal Animation Studios', 'Universal Cartoon Studios'
# 'Universal CGI', ,'Universal Pictures Corporation',
#'Universal Pictures International (UPI)',

#print([c for c in sorted(production_companies.production_company.unique()) if "Paramount" in c])
syn_company['Paramount'] = ['Paramount Pictures']
# ['Paramount Animation',
# 'Paramount Classics', , 'Paramount Vantage']

#print([c for c in sorted(production_companies.production_company.unique()) if "Columbia" in c])
syn_company['Columbia'] = [
    'Columbia Pictures', 'Columbia Pictures Corporation']
#'Columbia TriStar',
# 'Province of British Columbia Film Incentive BC', 'Province of British Columbia Production Services Tax Credit']

#print([c for c in sorted(production_companies.production_company.unique()) if "Warner" in c])
syn_company['Warner'] = ['Warner Bros.', 'Warner Bros. Pictures']
# 'Warner Bros. Animation', 'Warner Bros. Interactive Entertainment', 'Warner Independent Pictures (WIP)']

#print([c for c in sorted(production_companies.production_company.unique()) if "Fox" in c])
syn_company['Fox'] = ['20th Century Fox',
                      'Twentieth Century Fox Film Corporation', 'Twentieth Century Fox']
#'Fox Searchlight Pictures','Fox Atomic', '20th Century Fox Home Entertainment'
#'Fox 2000 Pictures', 'Fox Animation Studios',  'Fox International Productions', 'Fox Searchlight',
#'Foxtor Productions', 'Twentieth Century Fox Animation'

print([c for c in sorted(production_companies.production_company.unique()) if "Disney" in c])
syn_company['Disney'] = ['Disney', 'Walt Disney', 'Walt Disney Pictures']

#'Disney Double Dare You (DDY)', 'Disney Enterprises', 'DisneyToon Studios', 
#'Walt Disney Animation Australia', 'Walt Disney Animation Canada', 'Walt Disney Animation Studios', 
#'Walt Disney Feature Animation',  'Walt Disney Studios Motion Pictures', 'Walt Disney Television Animation']
                         
display(data[data.production_companies.str.contains('Disney Enterprises')].head(10))

print(syn_company)

def find_syn(orig_name):
    for k, v in syn_company.items():
        if orig_name in v:
            return k
    return orig_name


production_companies['production_company_syn'] = production_companies.apply(
    lambda x: find_syn(x['production_company']), axis=1)
production_companies.head(5)

['Disney', 'Disney Double Dare You (DDY)', 'Disney Enterprises', 'DisneyToon Studios', 'Walt Disney', 'Walt Disney Animation Australia', 'Walt Disney Animation Canada', 'Walt Disney Animation Studios', 'Walt Disney Feature Animation', 'Walt Disney Pictures', 'Walt Disney Studios Motion Pictures', 'Walt Disney Television Animation']

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,profit,release_date_as_date,release_month
1088,tt0266543,3.440519,94000000,864625978,Finding Nemo,Albert Brooks|Ellen DeGeneres|Alexander Gould|...,Andrew Stanton|Lee Unkrich,"There are 3.7 trillion fish in the ocean, they...",A tale which follows the comedic and eventful ...,100,Animation|Family,Walt Disney Pictures|Pixar Animation Studios|D...,5/30/2003,3692,7.4,2003,770625978,2003-05-30,5

{'Universal': ['Universal', 'Universal Pictures', 'Universal Studios'], 'Paramount': ['Paramount Pictures'], 'Columbia': ['Columbia Pictures', 'Columbia Pictures Corporation'], 'Warner': ['Warner Bros.', 'Warner Bros. Pictures'], 'Fox': ['20th Century Fox', 'Twentieth Century Fox Film Corporation', 'Twentieth Century Fox'], 'Disney': ['Disney', 'Walt Disney', 'Walt Disney Pictures']}

     imdb_id       production_company   production_company_syn
0  tt0369610        Universal Studios                Universal
1  tt0369610     Amblin Entertainment     Amblin Entertainment
2  tt0369610       Legendary Pictures       Legendary Pictures
3  tt0369610  Fuji Television Network  Fuji Television Network
4  tt0369610                   Dentsu                   Dentsu

# + 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [5]:
display(data[data.budget == data.budget.max()][['original_title', 'budget', 'imdb_id']])

# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
answer_ls.append(4)

        original_title     budget    imdb_id
491  The Warrior's Way  425000000  tt1032751

# +2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [6]:
display(data[data.runtime == data.runtime.max()][['original_title', 'runtime', 'imdb_id']])

answer_ls.append(2)

         original_title  runtime    imdb_id
1158  Gods and Generals      214  tt0279111

# + 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [7]:
display(data[data.runtime == data.runtime.min()][['original_title', 'runtime', 'imdb_id']])

answer_ls.append(3)

      original_title  runtime    imdb_id
769  Winnie the Pooh       63  tt1449283

# + 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [8]:
print(round(data.runtime.mean(),0))

answer_ls.append(2)

110.0

# + 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [9]:
print(round(data.runtime.median(),0))

answer_ls.append(1)

106.0

# + 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [10]:
#data['profit'] = data.revenue - data.budget
display(data[data.profit == data.profit.max()][['original_title', 'profit', 'imdb_id']])

answer_ls.append(5)

    original_title      profit    imdb_id
239         Avatar  2544505847  tt0499549

# + 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [11]:
display(data[data.profit == data.profit.min()][['original_title', 'profit', 'imdb_id']])

answer_ls.append(2)

        original_title     profit    imdb_id
491  The Warrior's Way -413912431  tt1032751

# + 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [12]:
print(len(data[data.profit > 0]))

answer_ls.append(1)

1478

# + 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [13]:
display(data[data.release_year == 2008].sort_values('profit', ascending=False).head(
    1)[['original_title', 'profit', 'release_year', 'imdb_id']])

answer_ls.append(4)

      original_title     profit  release_year    imdb_id
600  The Dark Knight  816921825          2008  tt0468569

# + 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [14]:
display(data[(data.release_year >= 2012) & (data.release_year <= 2014)].sort_values(
    'profit', ascending=True).head(1)[['original_title', 'profit', 'release_year', 'imdb_id']])

answer_ls.append(5)

       original_title     profit  release_year    imdb_id
1246  The Lone Ranger -165710090          2013  tt1210819

# +/- 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [15]:
# v1
c = Counter()
for g in itertools.chain.from_iterable(data.genres.str.split('|')):
    c[g] += 1
print(c.most_common(1))

# v2
display(genres.groupby('genre')['imdb_id'].count().sort_values(ascending=False).head(3))


answer_ls.append(3)

[('Drama', 782)]

genre
Drama       782
Comedy      683
Thriller    597
Name: imdb_id, dtype: int64

# + 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [16]:
# v1
c = Counter()
for g in itertools.chain.from_iterable(data[data.profit > 0].genres.str.split('|')):
    c[g] += 1
print(c.most_common(1))

# v2
display(genres.merge(data[data.profit > 0], on='imdb_id', how='inner').groupby(
    'genre')['imdb_id'].count().sort_values(ascending=False).head(3))

answer_ls.append(1)

[('Drama', 560)]

genre
Drama       560
Comedy      551
Thriller    446
Name: imdb_id, dtype: int64

# + 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [17]:
#v1 Не обрабатывает множественные значения в director
display(data.groupby(['director'])['imdb_id'].count().sort_values(ascending = False).head(3))

#v2
display(directors.groupby('a_director')['imdb_id'].count().sort_values(ascending=False).head(3))

#v3
c = Counter()
for g in itertools.chain.from_iterable(data.director.str.split('|')):
    c[g] += 1
print(c.most_common(1))

answer_ls.append(3)

director
Steven Soderbergh    13
Ridley Scott         12
Clint Eastwood       12
Name: imdb_id, dtype: int64

a_director
Steven Soderbergh    13
Ridley Scott         12
Clint Eastwood       12
Name: imdb_id, dtype: int64

[('Steven Soderbergh', 13)]

# + 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [18]:
#v1 Не обрабатывает множественные значения в director
display(data[data.profit > 0].groupby(['director'])['imdb_id'].count().sort_values(ascending = False).head(3))

#v2
display(directors.merge(data[data.profit > 0], on='imdb_id', how='inner').groupby(
    'a_director')['imdb_id'].count().sort_values(ascending=False).head(3))

#v3
c = Counter()
for g in itertools.chain.from_iterable(data[data.profit > 0].director.str.split('|')):
    c[g] += 1
print(c.most_common(1))

answer_ls.append(4)

director
Ridley Scott         12
Steven Spielberg     10
Steven Soderbergh    10
Name: imdb_id, dtype: int64

a_director
Ridley Scott        12
Clint Eastwood      10
Steven Spielberg    10
Name: imdb_id, dtype: int64

[('Ridley Scott', 12)]

# + 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [19]:
#v1 Если режиссёров несколько, то каждому считается вся прибыль
display(directors.merge(data, on='imdb_id', how='inner').groupby(
    'a_director')['profit'].sum().sort_values(ascending=False).head(3))

#v2 - пропорциональное разделение прибыли
display(data.head(5)[['imdb_id', 'director', 'profit']])
def dir_cnt(d):
    return len(d.director)
data["director_count"] = data.apply(lambda x: dir_cnt(x), axis = 1)
data["prop_profit"] = data["profit"]/data["director_count"]
display(data.head(5)[['imdb_id', 'director', 'profit', 'director_count', 'prop_profit']])
display(directors.merge(data, on='imdb_id', how='inner').groupby(
    'a_director')['prop_profit'].sum().sort_values(ascending=False).head(3))

answer_ls.append(5)

a_director
Peter Jackson        5202593685
David Yates          3379295625
Christopher Nolan    3162548502
Name: profit, dtype: int64

     imdb_id          director      profit
0  tt0369610   Colin Trevorrow  1363528810
1  tt1392190     George Miller   228436354
2  tt2908446  Robert Schwentke   185238201
3  tt2488496       J.J. Abrams  1868178225
4  tt2820852         James Wan  1316249360

     imdb_id          director      profit  director_count   prop_profit
0  tt0369610   Colin Trevorrow  1363528810              15  9.090192e+07
1  tt1392190     George Miller   228436354              13  1.757203e+07
2  tt2908446  Robert Schwentke   185238201              16  1.157739e+07
3  tt2488496       J.J. Abrams  1868178225              11  1.698344e+08
4  tt2820852         James Wan  1316249360               9  1.462499e+08

a_director
Peter Jackson    4.001995e+08
David Yates      3.072087e+08
J.J. Abrams      2.581064e+08
Name: prop_profit, dtype: float64

# + 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [20]:
display(casts.merge(data, on='imdb_id', how='left').groupby(['actor'])['profit'].sum().sort_values(ascending = False).head(3))

answer_ls.append(1)

actor
Emma Watson         6666245597
Daniel Radcliffe    6514990281
Rupert Grint        6408638290
Name: profit, dtype: int64

# + 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [21]:
display(casts.merge(data[data.release_year == 2012], on='imdb_id', how='left').groupby(
    ['actor'])['profit'].sum().sort_values(ascending=True).head(1))

answer_ls.append(3)

actor
Kirsten Dunst   -68109207.0
Name: profit, dtype: float64

# + 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [22]:
display(casts.merge(data[data.budget > data.budget.mean()], on='imdb_id', how='inner').groupby(
    ['actor'])['imdb_id'].count().sort_values(ascending=False).head(1))

answer_ls.append(3)

actor
Matt Damon    18
Name: imdb_id, dtype: int64

# + 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [23]:
display(data[data.cast.str.contains('Nicolas Cage')].merge(genres, on='imdb_id', how='inner').groupby(
    ['genre'])['imdb_id'].count().sort_values(ascending=False).head(1))

answer_ls.append(2)

genre
Action    17
Name: imdb_id, dtype: int64

# + 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [24]:
display(production_companies.groupby(['production_company_syn'])[
        'production_company_syn'].count().sort_values(ascending=False).head(5))


answer_ls.append(1)

production_company_syn
Universal    182
Warner       181
Columbia     164
Fox          127
Paramount    122
Name: production_company_syn, dtype: int64

# + 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [25]:
display(production_companies.merge(data[data.release_year == 2015], on='imdb_id', how='inner').groupby(
    ['production_company'])['imdb_id'].count().sort_values(ascending=False).head(5))

answer_ls.append(4)

production_company
Warner Bros.                              12
Universal Pictures                        10
Twentieth Century Fox Film Corporation     8
Paramount Pictures                         7
Columbia Pictures                          7
Name: imdb_id, dtype: int64

# + 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [26]:
display(production_companies.merge(data[data.genres.str.contains('Comedy')], on='imdb_id', how='inner').groupby([
    'production_company_syn'])['profit'].sum().sort_values(ascending=False).head(5))

answer_ls.append(2)

production_company_syn
Universal               9083535657
Disney                  7700093439
Columbia                7463624069
Fox                     6266513139
DreamWorks Animation    4789049764
Name: profit, dtype: int64

# + 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [27]:
display(production_companies.merge(data[data.release_year == 2012], on='imdb_id', how='inner').groupby(
    ['production_company_syn'])['profit'].sum().sort_values(ascending=False).head(5))

answer_ls.append(3)

production_company_syn
Columbia            2501406608
Universal           1981011579
Marvel Studios      1299557910
Warner              1258020056
Relativity Media    1032593938
Name: profit, dtype: int64

# + 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [28]:
display(data[data.production_companies.str.contains('Paramount Pictures')].
        sort_values('profit').head(3)[['original_title', 'profit', 'imdb_id']])

answer_ls.append(1)

            original_title    profit    imdb_id
926   K-19: The Widowmaker -64831034  tt0267626
1124              Timeline -60519261  tt0300556
1723                  Next -51788987  tt0435705

# + 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [29]:
display(data.groupby(['release_year'])['profit'].sum().sort_values(ascending = False).head(3))

answer_ls.append(5)

release_year
2015    18668572378
2014    16397812953
2012    16077001687
Name: profit, dtype: int64

# + 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [30]:
# v1 Этот вариант подошёл, но он странный, т.к. contains('Warner Bros') вроде как не подходит к использованию
display(data[data.production_companies.str.contains('Warner Bros')].groupby(
    ['release_year'])['profit'].sum().sort_values(ascending=False).head(3))

# v2 Этот вариант, вроде как правильнее по условиям, работает с учетом исторических названий
# но двает вариант ответа, который в принципе отсутствует в вариантах
d1 = production_companies[production_companies.production_company_syn == 'Warner']
d2 = d1.merge(data, on='imdb_id', how='left')
display(d2.groupby(['release_year'])['profit'].sum().sort_values(ascending=False).head(3))

# v3 По точному соответствию. Тоже дает ответ, которого нет в вариантах
d1 = data[data.production_companies == 'Warner Bros.']
display(d1.groupby(['release_year'])['profit'].sum().sort_values(ascending=False).head(3))

answer_ls.append(1)

release_year
2014    2295464519
2007    2201675217
2008    2134595031
Name: profit, dtype: int64

release_year
2007    2201675217
2008    2134595031
2014    1886303827
Name: profit, dtype: int64

release_year
2011    98586594
2013    55020213
2010   -10877196
Name: profit, dtype: int64

# + 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [31]:
#v1
display(data.groupby(['release_month'])['imdb_id'].count().sort_values(ascending = False))

#v2
display(data.groupby([data.release_date_as_date.dt.month])['imdb_id'].count().sort_values(ascending = False))

answer_ls.append(4)

release_month
9     227
12    191
10    186
8     161
3     156
4     149
6     147
11    146
7     142
5     140
2     135
1     110
Name: imdb_id, dtype: int64

release_date_as_date
9     227
12    191
10    186
8     161
3     156
4     149
6     147
11    146
7     142
5     140
2     135
1     110
Name: imdb_id, dtype: int64

# + 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [32]:
print(len(data[(data.release_month >=6) & (data.release_month <=8)]))

answer_ls.append(2)

450

# + 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [33]:
display(data[(data.release_month == 12) | (data.release_month == 1) | (data.release_month == 2)].groupby(['director'])['imdb_id'].count().sort_values(ascending=False).head(3))

answer_ls.append(5)

director
Peter Jackson        7
Clint Eastwood       6
Steven Soderbergh    6
Name: imdb_id, dtype: int64

# + 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [34]:
#v1 если считать по суммурному профиту
display(data.groupby(['release_month'])['profit'].sum().sort_values(ascending=False).head(5))

#v2 если считать по тому, сколько раз месяц был первым за каждый год
d = pd.DataFrame({'release_year': list(data.release_year.unique())})
def get_the_best_month_on_year(year):
    s = data[data.release_year==year].groupby('release_month')['profit'].sum().sort_values(ascending=False).index.values[0]
    return s
d['best_month'] = d.apply(lambda x: get_the_best_month_on_year(x.release_year), axis=1)
display(d.groupby('best_month')['release_year'].count().sort_values(ascending=False))

#v3 модифицированный v2, д.б. более быстрым
d = pd.DataFrame({'release_year': list(data.release_year.unique())})
df_ym = data.groupby(['release_year', 'release_month'])['profit'].sum().to_frame().reset_index(level=0).reset_index(level=0)
def get_the_best_month_on_year(year):
    s = df_ym[df_ym.release_year==year].sort_values('profit', ascending=False)['release_month'].values[0]
    return s
d['best_month'] = d.apply(lambda x: get_the_best_month_on_year(x.release_year), axis=1)
display(d.groupby('best_month')['release_year'].count().sort_values(ascending=False))

answer_ls.append(1)

release_month
6     27551262500
12    26563071474
5     25039516141
11    18654155473
7     18307895020
Name: profit, dtype: int64

best_month
6     7
12    4
5     4
7     1
Name: release_year, dtype: int64

best_month
6     7
12    4
5     4
7     1
Name: release_year, dtype: int64

# + 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [35]:
data['len_original_title'] = data.apply(lambda x: len(x['original_title']), axis=1)
df = production_companies.merge(data, on='imdb_id', how='inner').groupby(
    ['production_company_syn'])['len_original_title'].mean().sort_values(ascending=False)
display(df.head(3))

answer_ls.append(5)

production_company_syn
Four By Two Productions    83.0
Jim Henson Company, The    59.0
Dos Corazones              47.0
Name: len_original_title, dtype: float64

# + 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [36]:
import re
data['word_counts_in_original_title'] = data.apply(
    lambda x: len(re.split(r'[\s]', x['original_title'])), axis=1)
#data[['imdb_id', 'original_title', 'word_counts_in_original_title', 'production_companies']]
display(production_companies.merge(data, on='imdb_id', how='inner').groupby(
    ['production_company_syn'])['word_counts_in_original_title'].mean().sort_values(ascending=False).head(3))

answer_ls.append(5)

production_company_syn
Four By Two Productions    12.0
Jim Henson Company, The    10.0
Dos Corazones               9.0
Name: word_counts_in_original_title, dtype: float64

# + 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [37]:
#v1
c = Counter()
import re
for x in [d[1].original_title for d in data.iterrows()]:
    for w in re.split(r'[\s]',x):
        #print(re.split(r'[\b\W]',x))
        if w != '':
            c[w.lower()] += 1
print(len(c))  

#v2
c1 = Counter()
def calc_words(title,cntr):
    for w in re.split(r'[\s]',title.lower()):
        if w != '':
            cntr[w] += 1
data.apply(lambda x: calc_words(x.original_title, c1), axis=1)            
print(len(c1))

answer_ls.append(3)

2461
2461

# + 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [38]:
# v1 use 'vote_average'
d = data[data.vote_average >= data.quantile([.99]).vote_average.values[0]]
d_filt = d.original_title.isin(['Inside Out', 'Gone Girl', '12 Years a Slave', 'BloodRayne', 
                                'The Adventures of Rocky & Bullwinkle', 
                                'The Lord of the Rings: The Return of the King', 'Upside Down', '300', 
                                'Lucky Number Slevin'])
display(d[d_filt][['original_title', 'vote_average', 'imdb_id']].head(10))

# v2 use 'popularity'  wrong variant
d = data[data.popularity >= data.quantile([.99]).popularity.values[0]]
d_filt = d.original_title.isin(['Inside Out', 'Gone Girl', '12 Years a Slave', 'BloodRayne', 
                                'The Adventures of Rocky & Bullwinkle', 
                                'The Lord of the Rings: The Return of the King', 'Upside Down', '300', 
                                'Lucky Number Slevin'])
display(d[d_filt][['original_title', 'popularity', 'imdb_id']].head(10))

answer_ls.append(1)

                                     original_title  vote_average    imdb_id
9                                        Inside Out           8.0  tt2096673
128                                       Gone Girl           7.9  tt2267998
1082  The Lord of the Rings: The Return of the King           7.9  tt0167260
1192                               12 Years a Slave           7.9  tt2024544

Empty DataFrame
Columns: [original_title, popularity, imdb_id]
Index: []

# + 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [39]:
print("\nv1")
print("Johnny Depp & Helena Bonham Carter", len(data[data.cast.str.contains("Johnny Depp") & data.cast.str.contains("Helena Bonham Carter")]))
print("Hugh Jackman & Ian McKellen", len(data[data.cast.str.contains("Hugh Jackman") & data.cast.str.contains("Ian McKellen")]))
print("Vin Diesel & Paul Walker", len(data[data.cast.str.contains("Vin Diesel") & data.cast.str.contains("Paul Walker")]))
print("Adam Sandler & Kevin James", len(data[data.cast.str.contains("Adam Sandler") & data.cast.str.contains("Kevin James")]))
print("Daniel Radcliffe & Rupert Grint", len(data[data.cast.str.contains("Daniel Radcliffe") & data.cast.str.contains("Rupert Grint")]))

print("\nv2")
actors = ["Johnny Depp", "Helena Bonham Carter",
        "Hugh Jackman", "Ian McKellen",
        "Vin Diesel", "Paul Walker",
        "Adam Sandler", "Kevin James",
        "Daniel Radcliffe", "Rupert Grint"]
film_cnts = []
for pair in itertools.permutations(actors, r=2):
    l = len(data[data.cast.str.contains(pair[0]) & data.cast.str.contains(pair[1])])
    k = pair[0]+" & "+pair[1]
    film_cnts.append((k, l))
print(sorted(film_cnts, key=lambda d: d[1], reverse=True )[0])    

#v3. Расчетное время выполнения - 15-20 часов. Надо будет проверить 11611056 комбинаций :)
#film_cnts = []
#all_actors = list(casts.actor.unique())[:100]
#all_pairs = list(itertools.permutations(all_actors, r=2))
#print(len(all_actors), len(all_pairs))
#for pair in all_pairs:
#    l = len(data[data.cast.str.contains(pair[0]) & data.cast.str.contains(pair[1])])
#    k = pair[0]+" & "+pair[1]
#    film_cnts.append((k, l))
#print(sorted(film_cnts, key=lambda d: d[1], reverse=True )[0])    

print("\nv4")
c = Counter()
for d in data.iterrows():
    for p in itertools.combinations(sorted(d[1].cast.split("|")), 2):
        c[p[0]+" & " + p[1]] +=1
print(c.most_common(5))

print("\nv5")
c = Counter()
def process_row(d, cntr):
    for p in itertools.combinations(sorted(d.cast.split("|")), 2):
        cntr[p[0]+" & " + p[1]] +=1
data.apply(lambda d: process_row(d, c), axis=1)
print(c.most_common(5))


answer_ls.append(5)

v1
Johnny Depp & Helena Bonham Carter 6
Hugh Jackman & Ian McKellen 5
Vin Diesel & Paul Walker 5
Adam Sandler & Kevin James 5
Daniel Radcliffe & Rupert Grint 8

v2
('Daniel Radcliffe & Rupert Grint', 8)

v4
[('Daniel Radcliffe & Emma Watson', 8), ('Daniel Radcliffe & Rupert Grint', 8), ('Emma Watson & Rupert Grint', 8), ('Ben Stiller & Owen Wilson', 6), ('Helena Bonham Carter & Johnny Depp', 6)]

v5
[('Daniel Radcliffe & Emma Watson', 8), ('Daniel Radcliffe & Rupert Grint', 8), ('Emma Watson & Rupert Grint', 8), ('Ben Stiller & Owen Wilson', 6), ('Helena Bonham Carter & Johnny Depp', 6)]

# + 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [40]:
#v1 не-тру-пандас вариант
dict_df = {}
for director in list(directors.a_director.unique()):
    d = data[data.director.str.contains(director)][['imdb_id', 'director','profit']]
    dict_df[director] = round(len(d[d.profit>0])/len(d)*100, 2)
    
goal_directors = ['Quentin Tarantino', 'Steven Soderbergh', 'Robert Rodriguez', 'Christopher Nolan', 'Clint Eastwood']
k_pred = ""
v_pred = 0
for k, v in [(k, v) for k, v in dict_df.items() if k in goal_directors] :
    print(k, v)
    if v_pred <= v:
        k_pred = k
        v_pred = v
print("\nЛучшие шансы у ",k_pred, v_pred)

#v2 медленно работает
dirs = pd.DataFrame({'a_director': directors.a_director.unique()})
print(len(dirs))
def profit_movies_percent(director):
    d = directors[directors.a_director==director].merge(data, on='imdb_id', how='left')
    movie_count = len(d)
    profit_movie_count = len(d[d.profit>0])
    return round(profit_movie_count/movie_count*100, 2)
dirs['profit_movies_percent'] = dirs.apply(lambda x: profit_movies_percent(x.a_director), axis=1)
display(dirs[dirs.a_director.isin(goal_directors)].sort_values('profit_movies_percent', ascending=False))

#v3 быстрый
dirs = pd.DataFrame({'a_director': directors.a_director.unique()})
df = directors.merge(data, on='imdb_id', how='left')
d_movie_count = df.groupby(['a_director'])['imdb_id'].count().to_frame().reset_index(level=0).rename({'imdb_id':'movie_count'}, axis='columns')
d_profit_movie_count = df[df.profit>0].groupby(['a_director'])['imdb_id'].count().to_frame().reset_index(level=0).rename({'imdb_id':'profit_movie_count'}, axis='columns')
ddd = d_movie_count.merge(d_profit_movie_count, on='a_director', how='left').fillna(value={'profit_movie_count':0})
ddd['profit_movies_percent'] = ddd['profit_movie_count'] / ddd['movie_count'] * 100
display(ddd[ddd.a_director.isin(goal_directors)].sort_values('profit_movies_percent', ascending=False))

answer_ls.append(4)

Quentin Tarantino 85.71
Christopher Nolan 100.0
Clint Eastwood 83.33
Robert Rodriguez 72.73
Steven Soderbergh 76.92

Лучшие шансы у  Christopher Nolan 100.0
998

            a_director  profit_movies_percent
122  Christopher Nolan                 100.00
17   Quentin Tarantino                  85.71
148     Clint Eastwood                  83.33
289  Steven Soderbergh                  76.92
190   Robert Rodriguez                  72.73

            a_director  movie_count  profit_movie_count  profit_movies_percent
151  Christopher Nolan            8                 8.0             100.000000
748  Quentin Tarantino            7                 6.0              85.714286
157     Clint Eastwood           12                10.0              83.333333
902  Steven Soderbergh           13                10.0              76.923077
791   Robert Rodriguez           11                 8.0              72.727273

# Submission

In [41]:
len(answer_ls)

36

In [42]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       2
7    8       1
8    9       4
9   10       5
10  11       3
11  12       1
12  13       3
13  14       4
14  15       5
15  16       1
16  17       3
17  18       3
18  19       2
19  20       1
20  21       4
21  22       2
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       5
29  30       1
30  31       5
31  32       5
32  33       3
33  34       1
34  35       5
35  36       4